app/controllers/messages_controller.rb

INSERT INTO "messages" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["description", "1"], ["created_at", "2015-03-26 16:01:25.704293"], ["updated_at", "2015-03-26 16:01:25.704293"]]
---
  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]
---
  def destroy
    @message.destroy

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_message
      @message = Message.find(params[:id])